tutorials/suspensionFoam/RAS/MUSTE/MUSTE_CW/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     suspensionFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         250;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   50;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  off;

maxCo           0.3;

maxAlphaCo      0.3;

maxDeltaT       1e0;

libs (
     "libWilcoxOmegaWallFunction.so"
     );

// ************************************************************************* //
